{
  "name": "Deja Window",
  "description": "Deja Window is a GNOME Shell extension that gives you full control over your window geometry. It automatically restores the workspace, size, position, minimized and maximized state, always on top and always on visible workspace of specific applications when they open.\n\n🤔 Why Deja Window?\n\nIn \"vanilla\" GNOME, windows typically open in the current workspace either centered or in a upper-left layout.\nDeja Window bridges this gap by acting as an external memory for your window layout, forcing the desired position, size and states that the OS or the apps themselves cannot natively restore. Deja Window is also very useful for all those applications (such as Ghostty) that do not adequately manage the layout of their windows in Gnome.\n\n🚀 Features\n\n- Remembers the last known position, size (included workspace) and states (minimized and maximized, always on top and always on visible workspace) of your windows. \n- Configure specific rules per window (via WM_CLASS or Window Title). \n- Supports standard string matching and regular expressions (Regex) for advanced targeting. \n- Choose to restore workspace, size, position, minimized and maximized state, always on top and always on visible workspace, independently for each app.\n- Automatically centers windows that are configured but haven't been saved yet.\n- Handles the specific timing constraints of window management on Wayland.\n\nCompatibility Note: While this extension works with the majority of standard applications, some apps utilize custom layout mechanisms or non-standard toolkits that may override or ignore the extension's positioning attempts.\nMore troubleshooting info can be found in the README.md file on GitHub.",
  "uuid": "deja-window@mcast.gnomext.com",
  "donations": {
    "paypal": "MCastaldo"
  },
  "settings-schema": "org.gnome.shell.extensions.deja-window",
  "shell-version": [
    "46",
    "47",
    "48",
    "49"
  ],
  "url": "https://github.com/ihpled/deja-window",
  "version": 1
}